controllers/SiteController.php

SELECT COUNT(*) FROM `DaftarSurat`
SELECT * FROM `DaftarSurat` ORDER BY `index` LIMIT 10 OFFSET 10
SELECT COUNT(*) FROM `quran` INNER JOIN `quranindonesia` ON quranindonesia.SuraID=quran.SuraID and quranindonesia.VerseID=quran.VerseID  WHERE `quran`.`SuraId`='3'
SELECT `quran`.*, `quranindonesia`.`AyahText` AS `Indo` FROM `quran` INNER JOIN `quranindonesia` ON quranindonesia.SuraID=quran.SuraID and quranindonesia.VerseID=quran.VerseID  WHERE `quran`.`SuraId`='3' ORDER BY `verseID` LIMIT 20
---
    public function actionIndex($q="")
    {
        if ($q=="")
        {
         $Query = DaftarSurat::find();
         $pagination = new Pagination(['defaultPageSize'=>10,'totalCount'=>$Query->count(),]);
         $DaftarSurat = $Query->orderBy('index')->offset($pagination->offset)->limit($pagination->limit)->all();
         return $this->render('index',['DaftarSurat'=>$DaftarSurat,'pagination'=>$pagination,]);
        }
        else {
          $Query = Quran::find()
                ->select('quran.*,quranindonesia.AyahText as Indo,DaftarSurat.surat_indonesia')
                ->innerJoin('quranindonesia','quranindonesia.SuraID=quran.SuraID and quranindonesia.VerseID=quran.VerseID ')
                 ->innerjoin ('DaftarSurat','DaftarSurat.Index=quran.SuraID')
                ->filterWhere(['Like','quranindonesia.AyahText',  $q]);


        $pagination =new Pagination(['defaultPageSize'=>20,'totalCount'=>$Query->count(),]);
        $DaftarAyat = $Query->orderBy('verseID')->offset($pagination->offset)->limit($pagination->limit)->all();